Repository: andreimacavei/geysigning
Catalog: po/*.po
Languages: ro

source: unknown
ro: necunoscut

source: Name
ro: Nume

source: Key
ro: Cheie

source: Select key on the left
ro: Alege cheia din stanga

source: No expiration date
ro: Nu exista data de expirare

source: Expires
ro: Expira

source: Go ahead!
ro: Mergi inainte!

source: Keys
ro: Chei

source: Get Key
ro: Ia cheia

source: Scan Image
ro: Scaneaza Imaginea

source: Quit
ro: Exit

source: Key Fingerprint
ro: Amprenta Cheie

source: Fingerprint QR code
ro: Cod QR amprenta cheie

source: Signatures
ro: Semnaturi

source: signatures
ro: semnaturi

source: Type fingerprint
ro: Scrie amprenta cheii

source: or scan QR code
ro: sau scaneaza codul QR

source: QR Scanner
ro: Scaner QR

source: Open Image
ro: Deschide Imaginea

source: Signing the following key
ro: Semneaza cheia urmatoare

source: Press 'Next' if you have checked the ID of the person and you want to sign all UIDs on this key.
ro: Apasa 'Inainte' daca ai verificat ID-ul persoanei si vrei sa semnezi toate UID-urile acestei chei

source: The key was signed and an email was sent to key owner! What next?
ro: Cheia a fost semnata si un email a fost trimis detinatorului cheii. Ce urmeaza?

source: Resend email
ro: Retrimite email

source: Save key locally
ro: Salveaza cheia local

source: Revoke signature
ro: Revoca semnatura

source: Step 1: Scan QR Code or type fingerprint and click on 'Download' button
ro: Pas 1: Scaneaza codul QR sau tasteaza amprenta si apasa butonul 'Descarca'

source: Step 2: Compare the received fpr with the owner's fpr and click 'Sign'
ro: Pas 2: Compara amprenta primita cu cea a detinatorului cheii si apasa 'Semneaza'

source: Step 3: Key was succesfully signed and an email was send to owner.
ro: Pas 3: Cheia a fost semnata cu succes si un email a fost trimis detinatorului

source: Back
ro: Inapoi

source: Next
ro: Inainte

source: Error downloading key with fpr
ro: Eroare descarcare cheie cu amprenta
